{"pages":[],"posts":[{"title":"Build Personal Blog With Hexo and GitHub","text":"This article is a step by step instruction on creating a personal website using Hexo framework on GitHub pages with custom domain. What is Hexo?Hexo is a simple yet powerful static blog framework powered by Node.js. Setup and InstallationGitHub Create a GitHub account Create a new repository named &lt;github_username&gt;.github.io Git Install Git Configure your Git username/email Open the Git Bash Set your username:git config --global user.name &lt;github_username&gt; Set your email address:git config --global user.email &lt;github_email&gt; Generate SSH Key and add to GitHub From Git Bash, generate SSH keyssh-keygen -t rsa -C &lt;github_email&gt; Copy the SSH key from the id_rsa.pub file, and paste to GitHub SSH key setting page From Git Bash, check if the setting is successful. ssh git@github.com Node.js Install Node.js From Git Bash, check if Node.js install successfully. node -v Check if npm install successfully. npm -v HexoInstall Hexo with npm npm install -g hexo-cli Start Blogging Initialize the blog in current directory hexo init Create a new article hexo new &lt;title&gt; Edit the markdown file under /source/_posts Generate static file hexo generate Start local server hexo server Check the blog at http://localhost:4000 Change Theme Choose theme Clone the theme to /themes folder git clone &lt;github_repo&gt; Edit the _config.yml file in root directory to use new theme # Extensions ## Plugins: https://hexo.io/plugins/ ## Themes: https://hexo.io/themes/ theme: &lt;theme_name&gt; Follow the instructions on the theme’s Github read me for further setting. Start local server hexo server Check the blog at http://localhost:4000 Deploy GitHub Pages Edit the _config.yml file in root directory deploy: type: git repo: &lt;repository_url&gt; branch: master Install hexo deployer plugin npm install hexo-deployer-git --save Deploy the site hexo clean &amp;&amp; hexo generate &amp;&amp; hexo deploy Check the blog at http://&lt;github_username&gt;.github.io Front-matter and Other Setting Enable table of contents toc: true Apply categories and tags categories: - &lt;categoriy_name&gt; tags: - &lt;tag_name&gt; Enable read more &lt;!-- more --&gt; Use Custom Domain Backup and Recover Raw Files on GitHub Backup Files git init . git checkout -b hexo # new branch git add . git commit git remote add origin &lt;repository_url&gt; git push --set-upstream origin hexo Recover Files git clone &lt;repository_url&gt; cd &lt;github_username&gt;.github.io/ git checkout hexo npm install hexo server","link":"/2019/06/13/Build-personal-blog-with-Hexo-and-GitHub/"}],"tags":[{"name":"Git","slug":"Git","link":"/tags/Git/"}],"categories":[{"name":"Tutorials","slug":"Tutorials","link":"/categories/Tutorials/"}]}