{"pages":[],"posts":[{"title":"Build personal blog with Hexo and GitHub","text":"What is Hexo?Hexo is a simple yet powerful static blog framework powered by Node.js. Setup and InstallationGitHub Create a GitHub account Create a new repository named &lt;github_username&gt;.github.io Git Install Git Configure your Git username/email Open the Git Bash Set your username:git config --global user.name &lt;github_username&gt; Set your email address:git config --global user.email &lt;github_email&gt; Generate SSH Key and add to GitHub From Git Bash, generate SSH keyssh-keygen -t rsa -C &lt;github_email&gt; Copy the SSH key from the id_rsa.pub file, and paste to GitHub SSH key setting page From Git Bash, check if the setting is successful.ssh git@github.com Node.js Install Node.js From Git Bash, check if Node.js install successfully.node –v Check if npm install successfully.npm -v HexoInstall Hexo with npmnpm install -g hexo-cli Start Blogging Initialize the blog in current directoryhexo init Create a new articlehexo new &lt;title&gt; Generate static filehexo generate Start local serverhexo server Check the blog at http://localhost:4000 Change Theme Choose theme Clone the theme to /themes foldergit clone &lt;github_repo&gt; Edit the _config.yml file in root directory to use new theme 1234# Extensions## Plugins: https://hexo.io/plugins/## Themes: https://hexo.io/themes/theme: &lt;theme_name&gt; Follow the instructions on the theme’s Github read me for further setting. Start local serverhexo server Check the blog at http://localhost:4000 Deploy GitHub Pages Edit the _config.yml file in root directory 1234deploy: type: git repo: &lt;repository_url&gt; branch: master Install hexo-deployer-gitnpm install hexo-deployer-git --save Deploy the sitehexo clean &amp;&amp; hexo generate &amp;&amp; hexo deploy Check the blog at http://&lt;github_username&gt;.github.io Blog in Markdown Create a new articlehexo new &lt;title&gt; Edit the markdown file under /source/_posts Deploy the sitehexo clean &amp;&amp; hexo generate &amp;&amp; hexo deploy","link":"/2020/06/13/Build-personal-blog-with-Hexo-and-GitHub/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/06/13/hello-world/"}],"tags":[],"categories":[]}